"""
研究张量的目的是什么？

1.张量的定义。这个好像并不难
2.度量张量
--为什么度量张量可以拿来做修正
--为什么基向量点积可以得到度量张量。基向量映射到另一个基向量上是什么操作？这个和并矢什么关系？

--度量张量的指标升降作用
--对偶坐标相乘得到平面直角的长度


极坐标的问题在于空间仍然平直，只是换了个坐标系而已。这和斜角坐标系是一样的。
但有意思的是，极坐标系和斜角坐标系仍然存在度量张量, 联络系数这样的东西。

如果是空间本身不再平直，那又是什么样的情况呢？ 如果空间不平直，我们就没有有效的函数形式
又怎么推导自然基矢量呢？

张量的定义，有的东西让人越来越糊涂

二次分解得到的肯定是一个张量，但这个张量和度量张量区别就很大。

所以说，能够用一个坐标系，或者某一种坐标方法来表示的东西，都是张量。

张量并不是一个统一的东西。

张量不一定是n*n的，向量就是n*1的。

但度量张量这种一定是n**m

但张量具有统一的运算规则，比如加法，乘法

基矢量是怎么来的？如果不知道直角坐标系，那是不是可以假想一个直角坐标系？

幅度值+2个方向
三阶张量：幅度值+3个方向

方向又是什么意思？为什么用同一个坐标系的多次表示，就能够完整的表示一个物理量呢？



内积(点击)、外积、叉积（笛卡尔积）这三个鬼东西....


"""